# WallsOverlap Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..PerformanceFailures..::..WallsOverlap Property
BuiltInFailures..::..PerformanceFailures Class See Also
---
Walls overlap. Consider embedding walls, editing their extents or profile to avoid overlapping.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId WallsOverlap { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WallsOverlap As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ WallsOverlap {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..PerformanceFailures Class
Autodesk.Revit.DB Namespace